diary/201607/14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">

<head>
  <title>github中添加deploy keys-SSH连接免输密码</title>
  <meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
  <meta name="title" content="github中添加deploy keys-SSH连接免输密码" />
  <meta name="generator" content="Org-mode" />
  <meta name="generated" content="2016-07-22T20:10+0800" />
  <meta name="author" content="ALIANG" />
  <meta name="description" content="" />
  <meta name="keywords" content="DIARY" />

</head>

<body>

  <div id="preamble">

  </div>

  <div id="content">
    <h1 class="title">github中添加deploy keys-SSH连接免输密码</h1>

    <p>【aliang diary】-青春无限可能，拎得清，爱生活，爱自己
    </p>
    <p>
      -日期：2016-07-12；作者：阿亮；关键字：笔记、github
    </p>
    <div id="table-of-contents">
      <h2>Table of Contents</h2>
      <div id="text-table-of-contents">
        <ul>
          <li><a href="#sec-1">1 github中添加deploy keys-SSH连接免输密码</a>
            <ul>
              <li><a href="#sec-1-1">1.1 作用</a></li>
              <li><a href="#sec-1-2">1.2 步骤</a>
                <ul>
                  <li><a href="#sec-1-2-1">1.2.1 生成SSH密钥</a></li>
                  <li><a href="#sec-1-2-2">1.2.2 设置Github项目中的deploy keys</a></li>
                  <li><a href="#sec-1-2-3">1.2.3 测试配置是否成功</a></li>
                </ul>
              </li>
              <li><a href="#sec-1-3">1.3 [关键]修改连接方式</a></li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-1" class="outline-2">
      <h2 id="sec-1"><span class="section-number-2">1</span> github中添加deploy keys-SSH连接免输密码</h2>
      <div class="outline-text-2" id="text-1">


      </div>

      <div id="outline-container-1-1" class="outline-3">
        <h3 id="sec-1-1"><span class="section-number-3">1.1</span> 作用</h3>
        <div class="outline-text-3" id="text-1-1">

          <p>SSH验证指当那些需要提交的内容显示完成过后会弹出的一个小窗口提示我们输入用户名、密码。 设置SSH验证后可以免输密码直接提交。
          </p>
        </div>

      </div>

      <div id="outline-container-1-2" class="outline-3">
        <h3 id="sec-1-2"><span class="section-number-3">1.2</span> 步骤</h3>
        <div class="outline-text-3" id="text-1-2">


        </div>

        <div id="outline-container-1-2-1" class="outline-4">
          <h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 生成SSH密钥</h4>
          <div class="outline-text-4" id="text-1-2-1">

            <p>在命令行输入以下命令
            </p>


            <pre class="src src-bash">$ cd ~/.ssh # Checks to see if there is a directory named <span style="color: #00ff00;">".ssh"</span> in your
              user directory
            </pre>

            <p>
              使用 ssh-keygen 生成密钥
            </p>


            <pre class="src src-bash">$ ssh-keygen -t rsa -C <span style="color: #00ff00;">"your_email@example.com"</span> # Creates a new ssh key
              using the provided email Generating public/private rsa key pair. Enter file in which to save the key (/home/you/.ssh/id_rsa):
            </pre>

            <p>
              使用默认的文件名直接enter，接下来显示如下
            </p>


            <pre class="src src-bash">Enter passphrase (empty for no passphrase): [Type a passphrase] Enter same passphrase again: [Type passphrase
              again]
            </pre>

            <p>
              按提示输入密码即可（简化流程的话在键入命令
            </p>


            <pre class="src src-bash">ssh-keygen -t rsa -C <span style="color: #00ff00;">"your_email@example.com"</span>
            </pre>

            <p>
              以后的三次提示输入都可以直接回车跳过）。
            </p>
            <p>
              密钥生成成功
            </p>


            <pre class="src src-basg">Your identification has been saved in /home/you/.ssh/id_rsa. Your public key has been saved in /home/you/.ssh/id_rsa.pub.
              The key fingerprint is: &#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#27492;&#22788;&#26159;&#23494;&#38053;&#20869;&#23481;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;&#8230;
              your_email@example.com
            </pre>

          </div>

        </div>

        <div id="outline-container-1-2-2" class="outline-4">
          <h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> 设置Github项目中的deploy keys</h4>
          <div class="outline-text-4" id="text-1-2-2">

            <p>可以选择是在用户设置中添加密钥（Settings –&gt; SSH GPG keys）还是单个项目中添加密钥
            </p>
            <ul>
              <li>用户中添加密钥会让该帐号下的所有Github项目都免输密码
              </li>
              <li>项目中添加密钥只是让所添加的项目免输密码
              </li>
            </ul>

            <p>在这里以项目中添加密钥为例：
            </p>
            <p>
              在github项目的首页菜单栏中点击
            </p>
            <ol>
              <li>Settings
              </li>
              <li>Deploy keys
              </li>
              <li>add deploy key
              </li>
            </ol>

            <p>然后将生成的 id<sub>rsa</sub>.pub 中的内容全选复制到 key 输入框中，然后点击 Add key 完成添加公钥。
            </p>
          </div>

        </div>

        <div id="outline-container-1-2-3" class="outline-4">
          <h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 测试配置是否成功</h4>
          <div class="outline-text-4" id="text-1-2-3">




            <pre class="src src-bash">$ ssh -T git@github.com
            </pre>

            <p>
              如果出现以下内容即表示配置完成并且成功！
            </p>


            <pre class="src src-bash">Hi username! You've successfully authenticated, but GitHub does not provide shell access.
            </pre>

          </div>
        </div>

      </div>

      <div id="outline-container-1-3" class="outline-3">
        <h3 id="sec-1-3"><span class="section-number-3">1.3</span> [关键]修改连接方式</h3>
        <div class="outline-text-3" id="text-1-3">

          <p>在Github项目的控制台输出结果中链接仍然是https的连接，修改为SSH连接。
          </p>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble">
    <p class="date">Date: 2016-07-22T20:10+0800</p>
    <p class="author">Author: ALIANG</p>
    <p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version
      24</p>
    <a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

  </div>
</body>

</html>